ruby_app/dyno_app/app/views/fossils/index.html.erb


	<% @user = User.find(fossil.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]