ruby_app/dyno_app/app/controllers/fossils_controller.rb

SELECT "fossils".* FROM "fossils"
---
  def index
    @fossils = Fossil.all

INSERT INTO "fossils" ("user_id", "status", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = current_user
    fossil_params = params.require(:fossil).permit(:user_id, :status, :image)
    @fossil = Fossil.create(fossil_params)

SELECT "fossils".* FROM "fossils"
SELECT  "fossils".* FROM "fossils" WHERE "fossils"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @fossils = Fossil.all
    @fossil = Fossil.find(params[:id])