ruby_app/dyno_app/app/controllers/sessions_controller.rb

  def new
    @user = User.first
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1