ruby_app/dyno_app/app/controllers/users_controller.rb

  def create
    user_params = params.require(:user).permit(:email, :handle, :info, :image, :password)
    @users = User.create(user_params)
---
INSERT INTO "users" ("email", "handle", "info", "image", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"